tutorials/PlateFin/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 273;

boundaryField
{
    Wall
    {
        type            fixedValue;
        value           uniform 283;
    }
    Symmetry
    {
        type            symmetry;
    }
    In
    {
        type            fixedValue;
        value           $internalField;
    }
    Out
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        Kappa           Kappa;
        value           uniform 300;
        kappaMethod     fluidThermo;
    }
}

// ************************************************************************* //
